---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotMakeLanding
source: html/cd4b5c73-38a2-afa7-352c-68d2efb00558.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotMakeLanding Property

Can't make landing.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMakeLanding { get; }
```